#!/usr/bin/env python
# -*- coding: UTF-8 -*-

#-------------------------------------------------------------------------------
# Name:        модуль1
# Purpose:
#
# Author:      Prapor
#
# Created:     10.07.2017
# Copyright:   (c) Prapor 2017
# Licence:     <your licence>
#-------------------------------------------------------------------------------

#Tk - opensource проект используемый для создания пользовательского
#графического интерфейса, предоставляет библиотеку активных графических
#элементов (GUI elements), наиболее часто используемые в графических
#приложениях, таких как:
#    * Buttons - кнопки;
#    * Menues  - менюшки;
#    * Windows - окна.
#    и т.д. Библиотека была создана как расширение к скриптовому языку TCL.
#Данный язык был разработан как кроссплатформенный интерпертатор. Это означает,
#что если вы разрабатывали GUI, то оно будет работать под основными
#операционными системами.

#tkinter - это интерфейс Python к фреймворку Tk.

# You Application (Python)
#    |
#     -> Tkinter (Python Module)
#         |
#          -> _tkinter (C)
#               |
#                -> Tk Wigets (C and Tcl)
#                     |
#                      -> Tk(C)
#                          |
#                           -> Xlib(C)

from tkinter import *
from tkinter import ttk
def main():
    pass

if __name__ == '__main__':
    main()
